biteco/jmeter/summary_1000.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Reporte Autorizado,500,204,178,602,48.50,0.000%,16.58430,11.33,3.63,699.4
GET Reporte No Autorizado,500,197,175,521,39.70,100.000%,16.59861,5.77,3.64,355.8
TOTAL,1000,201,175,602,44.46,50.000%,33.16860,17.09,7.27,527.6